package javabasic.c_javabasic_concept;

/*
    标识符:
        指给类, 方法, 变量等起的名字
        命名规则(硬性要求):
            1. 由数字, 字母, 下划线(_)和美元符($)组成
            2. 不能以数字开头
            3. 不能是关键字
            4. 区分大小写
        软性建议:
            1. 小驼峰命名法: 方法, 变量
                1.1 标识符是一个单词的时候, 全部小写
                1.2 标识符由多个单词组成时, 第一个单词首字母小写, 其他单词首字母大写
            2. 大驼峰命名法: 类名
                2.1 标识符是一个单词的时候, 首字母大写
                2.2 标识符由多个单词组成时, 每个单词的首字母大写
 */

public class $7_Identifier {
}
