package javabasic.i_face_object;
/*
    类和对象:
        类(设计图): 是对象共同特征的描述
            定义类:
                public class 类名 {
                    1. 成员变量 (代表属性, 一般是名词)
                    2. 成员方法 (代表行为, 一般是动词)
                    3. 构造器
                    4. 代码块
                    5. 内部类
                }
        对象: 真是存在的具体实例
            获取类的对象:
                类名 对象名 = new 类名();
        在Java中, 必须先设计类, 再创建对象
    JavaBean类:
        指用来描述一类事物的类, 在JavaBean类中, 没有main方法, 编写main方法的类叫做测试类,
        在测试类中可以创建JavaBean类的对象并进行赋值调用
        定义类的注意事项:
            a. 类名首字母建议大写, 需要见名知意, 大驼峰模式, 不能是关键字, 满足标识符定义规则
            b. 一个文件中可以定义多个class类, 但只能有一个类是由public修饰, 且public修饰的类名必须与
               Java代码文件名相同, 实际开发建议一个文件定义一个类
            c. 成员变量的完整定义格式为: 修饰符 数据类型 变量名称 = 初始化值; 一般无需指定初始化值, 存在默认值
 */
public class $2_ClassAndObject {
}
