package javabasic.i_face_object;
/*
    封装:
        面向对象三大特征之一
        告诉我们如何正确设计对象的属性和方法
        原则: 对象代表什么, 就得封装对应的数据, 并提供数据对应的行为
        封装的优点:
            1. 让编程变得简单, 有什么事, 找对象, 调方法就行了
            2. 降低学习成本, 可以少学, 少记, 不需要记对象有哪些方法, 有需要时去找就行了
        private关键字:
            1. 是一个权限修饰符
            2. 可以修饰成员变量和成员方法
            3. 被private修饰的成员只能在本类中访问
        封装实现步骤:
            1.一般对成员变量使用private(私有)关键字修饰进行隐藏, private修饰后该成员变量就只能在当前类中访问
            2.对private修饰的成员变量提供public修饰的公开的getter, setter方法暴露其取值和赋值
        
 */
public class $3_Package {
}
